<template>
  <div class="page-content">
    <section data-type="inner">
      <div class="center">
        <h1>Виды лицензий</h1>

        <div class="contacts-info flex flex-just-b flex-wrap">
          <div class="col-7">
            <p>
              Как известно, шрифты могу быть как <b>платными</b>, так и
              <b>бесплатными</b>, однако существует еще одина категория —
              <b>условно-бесплатные</b>.
            </p>
            <p>
              На шрифты этой категории наложены определенные условия, которые
              выдвигает правообладатель.
            </p>
            <p>
              Как правило это возможность бесплатного использования в
              некоммерсческих (личных) целях, но бывают усключения — указания
              авторства на ресурсе, использующем шрифт.
            </p>

            <h3>Бесплатные шрифты</h3>
            <p>
              Данные шрифты наиболее "безопасны" в использовании в различных
              вариациях носителей (веб, полиграфия и т.д), однако могут
              содержать запреты на их модификацию.
            </p>

            <h3>Платные шрифты</h3>
            <p>
              Подобные виды шрифтов жестко классифицируются по категориям,
              основные из которых:
            </p>
            <ul>
              <li>
                <b>Десктоп</b> — обычно включает разрешение на воспроизведение
                изображения знаков шрифта на любых единицах полиграфии без
                ограничений теража при условии что посторонние лица не будут
                иметь доступ к редактированию этого изображения.
              </li>
              <li>
                <b>Веб</b> — лицензия использования на веб-страницах. Может
                нести в себе ограничение не количество просмотров в месяц
                (Обычно считаются просмотры, но могут и уникальные посетители).
                Стоит учитывать, что придется доплатить некую сумму, если
                ежемесячный трафик превысит квоту купленной лицензии.
              </li>
              <li>
                <b>Лого</b> — дает право использовать шрифт при создании
                логотипа и иногда несет в себе расширенный перечень
                возможностей, например: использование в документах, растовых
                изображениях и т.д.
              </li>
              <li>
                <b>Видео</b> — выбирая лицензию данного типа, вы сможете
                использовать купленный шрифт при создании видеороликов,
                сериалов, кино и тому подобных. Может ограничиваться количеством
                использования лицензии на один или несколько видеороликов.
              </li>
              <li>
                <b>Игра</b> — в случае с этим видом лицензии все достаточно
                просто. Вы можете использовать купленный шрифт в видеоиграх,
                разрабатываемых под десктопные ОС Windows, Mac OS, Linux, а так
                же для игровых приставок: X-Box, PlayStation, Nintendo и др.
                Скорее всего подобная лицензия не будет включать в себя
                возможность использования в игре на мобильной ОС.
              </li>
              <li>
                <b>Мобильное приложение</b> — лицензия дает право использовать
                шрифты в мобильных приложениях, а так же зачастую в мобильных
                играх.
              </li>
              <li>
                <b>Электронная публикация</b> — лицензия для использования
                шрифта в электронных книгах, журналах и других подобных
                публикациях (может ограничиваться количеством публикаций)
              </li>
              <li>
                <b>Сервер</b> — самая "мутная" из лицензий по нашему мнению.
                Позволяет установить шрифт на сервер, предоставляя пользователям
                возможность их использования в кастомизации каких-либо объектов.
                (Может ограничиваться использованием и количеством сервером)
              </li>
            </ul>

            <p>
              FontFamily на данный момент специализируется на использовании
              только бесплатных и условно-бесплатных шрифтов. Если вы
              правообладатель и заметили нарушение — напишите на почту
              <a href="mailto:making@fontfamily.ru">making@fontfamily.ru</a> и
              мы оперативно удалим принадлежащие вам шрифты при подтверждении
              авторства.
            </p>
          </div>
        </div>
      </div>
    </section>
  </div>
</template>

<script>
export default {
  data() {
    return {}
  },
  methods: {
    toggleAnswer(e) {
      let elem = e.target || e.srcElement

      if (!elem.classList.contains('question-item')) {
        elem = elem.closest('.question-item')
      }

      const answer = elem.querySelector('.answer')

      if (elem.classList.contains('active')) {
        elem.classList.remove('active')
        TweenLite.to(answer, 0.8, { height: 0, ease: Expo.easeOut })
      } else {
        elem.classList.add('active')
        TweenLite.set(answer, { height: 'auto' })
        TweenLite.from(answer, 0.8, { height: 0, ease: Expo.easeOut })
      }
    },
  },
}
</script>

<style lang="scss" scoped>
section[data-type='inner'] {
  padding: 222px 0 100px;
}

.contacts-info {
  margin-top: 100px;

  p {
    font-size: em(16);
    line-height: 2.125;
  }
}

.contacts-block {
  .title {
    font-size: em(16);
    font-weight: 500;
    color: #000;
    margin-bottom: 30px;
  }

  .contact-info {
    margin-bottom: 30px;

    &:last-child {
      margin-bottom: 0;
    }

    small {
      display: block;
      font-size: 13px;
    }

    .value {
      font-size: em(16);
      margin-top: 5px;
      display: inline-block;
    }
  }
}
</style>
